{
  "act_dim": 3,
  "action_tanh": true,
  "activation_function": "relu",
  "architectures": [
    "DecisionTransformerModel"
  ],
  "attn_pdrop": 0.05,
  "bos_token_id": 50256,
  "dtype": "float32",
  "embd_pdrop": 0.05,
  "eos_token_id": 50256,
  "hidden_size": 256,
  "initializer_range": 0.02,
  "layer_norm_epsilon": 1e-05,
  "max_ep_len": 1000,
  "model_type": "decision_transformer",
  "n_head": 4,
  "n_inner": null,
  "n_layer": 4,
  "n_positions": 1024,
  "reorder_and_upcast_attn": false,
  "resid_pdrop": 0.05,
  "scale_attn_by_inverse_layer_idx": false,
  "scale_attn_weights": true,
  "state_dim": 5,
  "transformers_version": "4.57.3",
  "use_cache": true,
  "vocab_size": 1
}
